Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: The subject provides opportunities to cooperate with local food producers, the Norwegian Food Safety Authority and the school health service.
nb: Kjerneelementet natur og kultur handler også om kunnskap om samisk mangfold, samiske verdier og livsformer og identitetsbygging.

source: use statistical sources to calculate and describe tendencies and variations in social science debates, and evaluate whether the statistics provide credible information
nb: bruke statistiske kilder til å beregne og beskrive tendenser og variasjoner i samfunnsfaglige drøftinger og vurdere om statistikken gir pålitelig informasjon

source: use formulae for the derivative of power, exponential and logarithmic functions, and differentiate composites, differences, products, quotients and combinations of these functions
nb: bruke formler for den deriverte til potens-, eksponential- og logaritmefunksjoner, og derivere summer, differanser, produkter, kvotienter og sammensetninger av disse funksjonene

source: The main subject area deals with knowledge of the English language and the selection and evaluation of various strategies for promoting personal language learning.
nb: Hovedområdet dreier seg om kunnskap om det engelske språket og valg og vurdering av ulike strategier for å fremme egen språklæring.

source: The subject shall prepare the pupils for everyday life and a workplace that requires innovation, practical skills and the ability to make aesthetic and ethical choices.
nb: Faget skal forberede elevene på et hverdags- og arbeidsliv som stiller krav om innovasjon, praktiske ferdigheter og evne til å gjøre estetiske og etiske valg.

source: Make it possible for the school health services to be available to students on the green, yellow and
nb: Legger til rette for at skolehelsetjenesten skal være til stede på grønt, gult og rødt nivå, og lett kan

source: give an account of the structure and properties of amino acids, proteins, lipids, carbohydrates and ATP
nb: gjøre rede for struktur og egenskaper til aminosyrer, proteiner, lipider, karbohydrater og ATP

source: read, interpret and use printed and digital maps, and be able to use and read scales and legends on a map
nb: lese, tolke og bruke papirbaserte og digitale kart, målestokk og karttegn og sammenlikne tradisjonelle og moderne måter å finne fram i naturen på

source: This applies to students, parents/guardians and staff, including union representatives and safety officers.
nb: Les mer om råd om håndhygiene, inkludert valg av produkter, fremgangsmåte og hudpleie på Folkehelseinstituttet nettsider.

source: That is a prerequisite for learning to read and do maths, for example.’
nb: Det er en forutsetning for å lære å lese og for å lære for eksempel matematikk.

source: About 79 per cent of all the responses to the survey mentioned this category.
nb: 79 prosent av alle som svarte på undersøkelsen, nevnte denne kategorien.

source: It also focuses on who and what influences young people today.
nb: Det handler også om hvem og hva som påvirker ungdom i dag.

source: listen and give response to others in conversations, during presentations and when reading out loud
nb: samtale om hvordan valg av tegn, ansiktsuttrykk og kroppsspråk skaper ulik mening i tegnspråktekster

source: Social economics 2 builds on Social economics 1.
nb: Samfunnsøkonomi 2 bygger på samfunnsøkonomi 1.

source: ‘Children are social, and they inspire each other to be active.
nb: – Barn er sosiale, og de inspirerer hverandre til å være i aktivitet.

source: However, this research applied to children aged three or older, according to the two researchers Brit Eide and Ellen Os.
nb: Men dette er forskning som omfatter barn over tre år, konstaterer de to forskerne Brit Eide og Ellen Os.

source: For these leaders, personnel management takes place spontaneously and is reflected in the practical and pedagogical work they do.
nb: Hun opplever at ledelse av medarbeiderne oppstår spontant og trer fram i det praktiske og pedagogiske arbeidet.

source: The subject emphasises religious and philosophical traditions in Norwegian, European and international contexts.
nb: Faget legger vekt på religiøse og filosofiske tradisjoner i norsk, europeisk og internasjonal sammenheng.

source: Positive values are in favour of girls.
nb: Positive verdier er i jentenes favør.

source: In addition, it deals with nomenclature, which is used to systemize the increasingly large number of organic compounds.
nb: I tillegg dreier det seg om navnsetting, som brukes til å systematisere det store antallet organiske forbindelser.

source: The conflict must also allow antagonisms, not merely confrontations’, in Johansson’s opinion.
nb: Og konflikten må tillate motsetninger, ikke bare konfrontasjoner, mener Johansson.

source: Meanwhile, the children live in a global world and can be engaged at many levels, also on the big issues’, remarks Caiman.
nb: Samtidig lever de i en global verden og kan være engasjert på mange plan, også i de store spørsmålene, sier Caiman.

source: make estimates and measure magnitudes for length, area, mass, volume, angle and time, and use time and time intervals in simple calculations, then discuss the results and assess the reasonableness of the results
nb: gjøre overslag over og måle størrelser for lengde, areal, masse, volum, vinkel og tid, og bruke tidspunkt og tidsintervall i enkle beregninger, diskutere resultatene og vurdere hvor rimelige de er

source: ‘This involves thinking of ourselves and each other as individuals in relation to one another, not as separate individuals.
nb: – Med det mener jeg at vi må tenke på oss selv og hverandre som personer i en relasjon, ikke som atskilte individer.

source: Norwegian for the Hearing Impaired should be seen in the context of the Norwegian Sign Language curriculum.
nb: Norsk for døve og sterkt tunghørte må sees i sammenheng med læreplanen for norsk tegnspråk.

source: In art and crafts, the interdisciplinary topic of democracy and citizenship challenges the pupils to critically reflect on art, design and material and intellectual cultures, and to express their own experiences, thoughts and opinions.
nb: I kunst og håndverk handler det tverrfaglige temaet demokrati og medborgerskap om at elevene utfordres til å reflektere kritisk over kunst, design og materiell og immateriell kultur og til å gi uttrykk for egne opplevelser, tanker og meninger.

source: explain the construction of simple hydraulic/pneumatic systems and how they work, and carry out measurements of pressure and make adjustments
nb: forklare oppbygning av og virkemåte til enkle hydraulikk-trykkluftsystemer og foreta trykkmålinger og justeringer

source: describe the living conditions and social development of women and men regarding gender equality in Norway
nb: beskrive utviklingen i levekårene til kvinner og menn og samtale om likestilling

source: For this reason, Knowledge of Christianity will be a major portion of the learning content of the subject.
nb: Faget skal fremme forståelse av og respekt for kristne og humanistiske verdier, og evne til dialog mellom mennesker med ulik oppfatning av tros- og livssynsspørsmål.

source: and lower secondary education.
nb: velge selv og utforske.

source: The results agree closely with those of previous research where there was seen to be a tendency that boys performed slightly better than girls in mathematics at the lowest school levels, but that this difference had evened out by the middle school (Grønmo, 2000).
nb: Resultatet stemmer overens med konklusjoner fra tidligere forskning, nemlig at det er en tendens til at gutter i Norge gjør det litt bedre enn jenter i matematikk på de laveste trinnene i skolen, men at denne forskjellen ser ut til å jevne seg ut på ungdomstrinnet (Grønmo, 2000).

source: In an inclusive learning environment, pupil participation is positive for the develop-ment of social relations and motivation for learning at all stages of the education.
nb: I et inkluderende læringsmiljø er elevmedvirkning positivt for utviklingen av sosiale relasjoner og motivasjon for læring på al e trinn i opplæringen.

source: identify central biblical texts, and explain the relationship between the Old and New Testaments
nb: finne fram til sentrale skrifter i Bibelen og forklare forholdet mellom Det gamle og Det nye testamente

source: choose and use materials based on their qualities and limitations
nb: velge og bruke materialer ut fra deres egenskaper og begrensninger

source: draw shapes and depth using techniques such as overlapping and
nb: tegne form og dybde ved bruk av virkemidler som overlapping og

source: carry out experiments with radioactivity, half-life and background radiation and explain these phenomena
nb: gjennomføre forsøk med radioaktivitet, halveringstid og bakgrunnsstrålingog forklare fenomenene

source: But neither Håkon Sakshaug nor Marius Larsen are occupied with being masculine role models.
nb: Men Håkon Sakshaug og Marius Larsen er ikke opptatt av at de er spesielt maskuline forbilder.

source: describe and interpret graphic presentations of numbers and other data
nb: beskrive og tolke grafiske presentasjoner av tall og andre data

source: The subject area also covers criteria that regulate and influence different populations in an ecosystem.
nb: Hovedområdet nasjonalregnskap og økonomisk vekst handler om måling av sentrale økonomiske størrelser, landets produksjon og vekst og hvordan produksjon anvendes.

source: Central functions included in the main subject area are polynomial functions, power functions, rational functions, logarithmic functions, exponential functions, periodic functions and combinations of these.
nb: Sentrale funksjoner som inngår i hovedområdet, er polynomfunksjoner, potensfunksjoner, rasjonale funksjoner, logaritmefunksjoner, eksponentialfunksjoner, periodiske funksjoner og sammensetninger av dem.

source: give an account of oxidation, substitution, addition, elimination, condensation and hydrolysis as types of reactions, and carry out experiments with at least two of them
nb: gjøre rede for reaksjonstypene oksidasjon, substitusjon, addisjon, eliminasjon, kondensasjon og hydrolyse, og gjøre forsøk med minst to av dem

source: Lucas sits on his behind and slides down elegantly.
nb: Lucas setter seg på rompa og sklir ned på en elegant måte.

source: In upper secondary education the social studies subject has competence aims after Vg1 in programme areas for science and languages, social sciences and economics studies in programmes for specialisation in general studies.
nb: I videregående opplæring har samfunnsfag kompetansemål etter Vg1 i programområdene for samfunnsfag og økonomi, realfag og språkfag i studiespesialiserende utdanningsprogram.

source: They also demonstrate and develop competence in mathematics when using knowledge and skills to explore, formulate and solve problems related to practical situations.
nb: De viser og utvikler også kompetanse når de bruker kunnskap og ferdigheter til å utforske, formulere og løse problemer som er knyttet til praktiske situasjoner.

source: perform in various language roles through role play and drama, reading aloud, interviews and presentations
nb: opptre i ulike språkroller gjennom rollespill og drama, opplesing, intervju og presentasjoner

source: explain differences between living in a democracy and in a non-democratic society, and elaborate on the most important institutions of power in Norway
nb: forklare forskjeller mellom å leve i et demokrati og i et samfunn uten demokrati og beskrive de viktigste maktinstitusjonene i det samiske og det norske samfunnet

source: Art and crafts is an important subject for practical skills, creativity and reflection on visual and material cultures.
nb: Kunst og håndverk er et sentralt fag for praktiske ferdigheter, kreativitet og refleksjon over visuell og materiell kultur.

source: In art and crafts, the interdisciplinary topic of sustainable development involves developing the ability to notice product improvements and to explore a more sustainable future lifestyle through practical creative work.
nb: I kunst og håndverk handler det tverrfaglige temaet bærekraftig utvikling om at elevene gjennom praktisk skapende arbeid utvikler evne til å se forbedringer i produkter og til å utforske mer bærekraftige levesett for framtiden.

source: elaborate on the main features of the industrial revolution and examine its importance for the development of trade, commerce and industry and societal conditions in Norway
nb: gjøre rede for hovedtrekk ved den industrielle revolusjon og undersøke hvilken betydning den fikk for næringsutvikling og sosiale forhold i det norske samfunnet

source: in Chemistry involves calculating quantities, concentrations and pH values, and evaluating the results.
nb: i kjemi innebærer å beregne stoffmengder, konsentrasjoner og pH, og vurdere svarene.

source: Competence aims after Level Vg1 general study programmes and Level Vg2 vocational study programmes
nb: Etter Vg1 studieforberedende utdanningsprogram og Vg2 yrkesfaglige utdanningsprogram

source: Operation and maintenance 224 teaching hours per year Basic skills
nb: Drift og vedlikehold 224 årstimer Grunnleggende ferdigheter

source: talk about respect and tolerance, and counteract bullying in real life
nb: samtale om respekt og toleranse og motvirke mobbing i praksis

source: The programme subject gives an introduction to concepts, symbols and language, and links theory and arithmetical calculations with observations and practical laboratory work.
nb: Programfaget fysikk gir innføring i fysikkens begreper, symboler og språk, og knytter teori og beregninger til observasjoner og praktisk laboratoriearbeid.

source: read, systematise and summarise information in complex Sign Language texts and reflect on their content
nb: beherske tekstutvikling fra ide til produkt og kunne tilpasse språk og virkemidler til ulike tekster og formål

source: explain what attitudes and prejudices are, and discuss and elaborate on opportunities and challenges in multicultural communities
nb: forklare hva holdninger og fordommer er og drøfte muligheter og utfordringer i flerkulturelle samfunn

source: reflect on their own experience with a variety of learning strategies
nb: reflektere over egen erfaring med ulike læringsstrategier

source: Competence aims after Year 4 Language learning
nb: Kompetansemål etter 4. årstrinn Språklæring

source: They spend 17 per cent of the their time on practical tasks that don’t involve the children.
nb: 17 prosent av tiden bruker de til praktiske oppgaver der barna ikke er involvert.

source: Further, about 70 per cent of the children responded that they are never asked to take part in deciding where to go on field trips.
nb: Videre svarte rundt 70 prosent av barna at de aldri fikk være med på å bestemme hvor de skulle dra på tur.

source: The core element cultural awareness involves exploring modern visual culture and cultural heritage in different parts of the world as experiential and inspirational sources in their own creative practice.
nb: Kjerneelementet kulturforståelse innebærer at elevene skal utforske samtidens visuelle kultur og kulturarv fra ulike verdensdeler som kilde til opplevelser og inspirasjon til egen skapende praksis.

source: Several have a bad conscience for not doing so’, continues Toft.
nb: Flere har dårlig samvittighet fordi de ikke gjør det, sier Toft.

source: ments in just some or a few subjects.
nb: som presenteres i Elevinspektørene.

source: make estimates of and find numbers by means of counting in one’s head, using counting aids and written notes, making estimates by calculatiing with simple numbers, and assessing answers
nb: gjøre overslag over og finne tall ved hjelp av hoderegning, tellemateriell og skriftlige notater, gjennomføre overslagsregning og vurdere svar

source: The main subject area deals with the communication of meaning by means of language.
nb: Hovedområdet dreier seg om formidling av mening gjennom språket.

source: do calculations on consumption, use of credit cards, income, loans and savings, set up budgets and accounts using a spreadsheet, explain the calculations and present the results
nb: gjøre beregninger om forbruk, bruk av kredittkort, inntekt, lån og sparing, sette opp budsjett og regnskap ved å bruke regneark og gjøre rede for beregninger og presentere resultatene

source: EHS evaluations and quality assurance, with related documentation and non-conformance processing, are key elements in the programme subject.
nb: HMS-vurderinger og kvalitetssikring, med tilhørende registrering og avviksbehandling, står sentralt i programfaget.

source: These guidelines provide insight into and examples of how kindergartens, primary, secondary and upper secondary schools, as well as out-of-school care (SFO), can stay open, while at same time complying with infection control measures.
nb: Disse veilederne gir innsikt i og eksempler på hvordan barnehagen, grunnskolen, videregående opplæring og skolefritidsordningen (SFO) kan organiseres samtidig som smitteverntiltak blir ivaretatt.

source: explain the term international division of labour, and elaborate on and discuss the relationships between production and social change from a global perspective
nb: forklare begrepet internasjonal arbeidsdeling og drøfte sammenhenger mellom produksjon og samfunnsendring i et globalt perspektiv

source: select and use appropriate writing and speaking strategies that are adapted to a purpose, situation and genre
nb: velge og bruke egnede skrive- og talestrategier tilpasset formål, situasjon og sjanger

source: In addition, it involves the choice of machines, tools and equipment, where current regulations and relevant standards play a key role.
nb: Videre står valg og bruk av maskiner, redskaper og utstyr, gjeldende regelverk og relevante standarder sentralt.

source: special education assistance experience kindergarten differently from other children’, says the researcher Siv Hillesøy.
nb: spesialpedagogisk hjelp, har en annerledes barnehagehverdag enn andre barn i barnehagen, fastslår forsker Siv Hillesøy.

source: When they fail to master the same activities as the others, they feel left out.
nb: Når de ikke mestrer de samme aktivitetene som de andre, føler de seg utenfor.

source: Medium, individual and society
nb: Medium, individ og samfunn

source: The quality framework is an integral part of the foundation on which the quality of primary and secondary education and training can be further developed and on which the school and apprenticeship-training enterprise can be systematical y assessed.
nb: Prinsipper for opplæringen skal inngå i grunnlaget for å videreutvikle kvalite­ten i grunnopplæringen og for systematisk vurdering av skole og lærebedrift.

source: describe how consumer patterns have developed in Norway and elaborate on consumer rights
nb: beskrive hvordan forbruksmønstre har utviklet seg i Norge, og gjøre rede for forbrukerrettigheter

source: prepare and discuss his/her own oral or written texts inspired by literature and art
nb: lage og samtale om egne muntlige eller skriftlige tekster inspirert av litteratur og kunst

source: Source criticism, copyright and personal protection are all key concerns in the digital arena.
nb: Kildekritikk, opphavsrett og personvern står sentralt i digitale sammenhenger.

source: The main subject area Economic geography deals with the relationship between resources, finances and social change.
nb: handler om sammenhenger mellom ressurser, økonomi og samfunnsendring.

source: compare different accounts of an event and reflect on the fact that
nb: Refleksjon innebærer å prøve ut egne tanker og holdninger for å utvikle bedre innsikt og forståelse.

source: talk about how the humanistic philosophy of life is expressed through maxims, rules of conduct and ceremonies
nb: lytte til og samtale om tekster og fortellinger som uttrykker et humanistisk livssyn

source: describe and analyse some aesthetic and ritual expressions in Christianity
nb: beskrive og analysere noen estetiske og rituelle uttrykk i kristendommen

source: talk about key persons and actions in a selection of fictional texts and texts taken from everyday life
nb: samtale om sentrale personer og handlinger i et utvalg skjønnlitterære tekster og tekster fra dagliglivet

source: It involves using specialised instruments for measuring, monitoring and controlling processes and production such as feeding, water temperature, salinity, pH, oxygen and light.
nb: Det betyr å bruke spesialiserte instrumenter til målinger, overvåkning og styring av prosess og produksjon som fôring, vanntemperatur, salinitet, pH, oksygen og lys.

source: elaborate on the number π and use it for calculating circumference, area and volume
nb: gjøre rede for tallet π og bruke det i beregninger av omkrets, areal og volum

source: analyze, elaborate on and discuss how cultures develop and change through communication
nb: analysere og drøfte hvordan kulturer utvikles og forandres gjennom kommunikasjon

source: in Machines involves using digital tools for planning, trouble-shooting, repairing, testing and documentation.
nb: i programområde for arbeidsmaskiner innebærer å bruke digitale verktøy til planlegging, feilsøking, reparasjon, testing og dokumentasjon.

source: Provisions for final assessment:
nb: Bestemmelser for sluttvurdering:

source: Assessment is for learning (AifL):
nb: aifl legg vekt på tre former for vurdering:

source: Reading and writing
nb: unntaket i andre ledd.

source: Proficiency in mathematics is an important tool for each individual, and the subject can form the basis for pursuing further education and for participation in working life and recreational activities.
nb: Kompetanse i matematikk er et viktig redskap for den enkelte, og faget kan legge grunnlag for å ta videre utdanning og for å delta i yrkesliv og fritidsaktiviteter.

source: Competence in preventive work and early warning systems is fundamental to local and global perspectives.
nb: Kompetanse om forebyggende arbeid og varslingssystemer er sentralt både i lokalt og globalt perspektiv.

source: plan and implement experiments and carry out relevant experiments within the various main subject areas
nb: uttrykke egne meninger på norsk eller tegnspråk i diskusjoner og vurdere hva som er saklig argumentasjon

source: discuss and elaborate on issues in connection with nutrition, exercise, dieting, eating disorders, lifestyle diseases and sunbathing
nb: drøfte spørsmål knyttet til ernæring, trening, slanking, spiseforstyrrelser, livsstilssykdommer og soling

source: in Physics involves investigating, measuring, recording, analysing, documenting and publishing results by digital means.
nb: i fysikk innebærer å utforske, måle, registrere, analysere, dokumentere og publisere digitalt.

source: In this programme subject, the individual shall develop confidence in natural science concepts and scientific working methods, and learn how to assess one’s own work and results.
nb: I programfaget skal den enkelte utvikle fortrolighet med naturvitenskapelig tankegang og naturvitenskapelige arbeidsmåter, og kunne vurdere eget arbeid og resultater.

source: derive the basic arithmetical rules for logarithms, and use these and the power rules to simplify expressions and solve equations and inequalities
nb: utlede de grunnleggende regnereglene for logaritmer, og bruke dem og potensreglene til å forenkle uttrykk og løse likninger og ulikheter

source: That irritates Bjørn and he bites Anna’s hand.
nb: Da blir Bjørn irritert og biter Anna i hånden.
